import { DetailsCard } from "./DetailsCard";

const details = [
    {
        title: "Онлайн - живі уроки у Zoom",
        description:
            "Іноземна стає частиною життя, а не лише домашнім завданням. Навчайся з будь-якої точки світу — без доріг і втрати часу. Батьки можуть бути поруч, якщо є бажання відчути цю подорож разом. Інтерактивний простір: діти говорять, пробують, помиляються й знову відкривають нові слова.",
        icon: "/online.svg",
    },
    {
        title: "Офлайн - затишні, сучасні класи",
        description:
            "Тут панує жива енергія спілкування. Діти не лише здобувають знання, а й відкривають у собі нові сили: вчаться працювати в команді, розвивають соціальні навички, набувають впевненості в собі. І все це — у легкій ігровій формі, де навчання перетворюється на пригоду.",
        icon: "/offline.svg",
    },
    {
        title: "Смарт-групи",
        description:
            "До 10 учнів — саме стільки потрібно для живої взаємодії, практики говоріння та ефективного навчання. Групи формуються за рівнем знань, тож діти навчаються разом із тими, хто на одній хвилі, без страху зробити помилку.",
        icon: "/mini.svg",
    },
    {
        title: "Індивідуальні уроки",
        description:
            "Ми підберемо викладача, програму та зручний графік саме під ваші потреби. Індивідуальні уроки допомагають швидко побачити прогалини у знаннях і закрити їх. Уже з перших уроків ви відчуєте рух уперед і динаміку. Ми працюємо як із загальним підвищенням рівня англійської та німецької мов, так і з підготовкою до іспитів чи тестів. Це не просто навчання — це шлях до власної сили та свободи в мові.",
        icon: "/individual.svg",
    },
    {
        title: "Зручний графік",
        description:
            "Двічі на тиждень по 60 хвилин — рівновага між навчанням і відпочинком. Для тих, хто прагне швидших результатів, є інтенсив: тричі на тиждень по 45 хвилин. Це не про навантаження, а про живий ритм, де знання засвоюються природно, а прогрес відчувається вже з перших кроків.",
        icon: "/schedule.svg",
    },
    {
        title: "Наші викладачі — провідники у світ мов",
        description:
            "Кожен урок із ними — це не суха граматика, а захоплива подорож у світ англійської та німецької. Вони відчувають дітей, відкривають у них цікавість і створюють атмосферу дружби та довіри. У такому просторі знання засвоюються легко, а результат приходить природно — чи це затишний клас офлайн, чи живе спілкування онлайн.",
        icon: "/teachers.svg",
    },
];
export const DetailsList = () => {
    return (
        <section
            id="course"
            className="pc:pb-16 pc:px-10 overflow-hidden px-4 pb-12"
        >
            <h2 className="font-montserrat pc:text-5xl pc:max-w-[410px] pc:mb-10 mb-6 max-w-[300px] text-3xl font-semibold">
                Детальніше про навчання
            </h2>
            <ul className="pc:gap-10 flex flex-wrap justify-center gap-5 whitespace-pre-line">
                {details.map((detail, index) => (
                    <DetailsCard index={index} key={index} detail={detail} />
                ))}
            </ul>
        </section>
    );
};
