import { DetailsCard } from "./DetailsCard";

const details = [
    {
        title: "Онлайн навчання",
        description:
            "Живі уроки у Zoom з викладачем. Вчитись можна з будь-якого місця без витрат часу на дорогу. За бажанням батьки можуть приєднатися. Інтерактивний формат: діти спілкуються, виконують завдання та практикують англійську.",
        icon: "/icon1.png",
    },
    {
        title: "Офлайн навчання",
        description:
            "Затишні, сучасні класи з живим спілкуванням. Тут діти розвивають не лише знання, а й соціальні навички, вчаться працювати в команді та відчувають впевненість у собі.",
        icon: "/icon1.png",
    },
    {
        title: "Міні-групи",
        description:
            "До 10 учнів у групі — достатньо, щоб кожен мав час висловитися, поставити питання й отримати увагу викладача. Групи формуються за рівнем знань, тож діти навчаються разом із тими, хто на одній хвилі, без страху зробити помилку.",
        icon: "/icon1.png",
    },
    {
        title: "Індивідуальні заняття",
        description:
            "Ми підберемо викладача, програму та зручний графік саме під ваші потреби. Індивідуальні уроки допоможуть швидко визначити прогалини у знаннях і закрити їх, щоб ви відчули динаміку з перших занять. Працюємо як із загальним підвищенням рівня англійської, так і з підготовкою до іспитів чи тестів.",
        icon: "/icon1.png",
    },
    {
        title: "Зручний графік",
        description:
            "Двічі на тиждень по 60 хвилин — саме стільки потрібно, щоб бачити прогрес і водночас мати час для відпочинку та інших занять.",
        icon: "/icon1.png",
    },
    {
        title: "Досвідчені викладачі",
        description:
            "Наші викладачі перетворюють уроки на захопливу подорож у світ англійської. Вони вміють зацікавити дитину, створити дружню атмосферу та забезпечити результат — як в офлайні, так і онлайн.",
        icon: "/icon1.png",
    },
];
export const DetailsList = () => {
    return (
        <section
            id="course"
            className="pc:pb-16 pc:px-10 overflow-hidden px-4 pb-12"
        >
            <h2 className="font-montserrat mb-6 max-w-[300px] text-4xl font-semibold">
                Детальніше про навчання
            </h2>
            <ul className="pc:gap-10 flex flex-wrap justify-center gap-5">
                {details.map((detail, index) => (
                    <DetailsCard index={index} key={index} detail={detail} />
                ))}
            </ul>
        </section>
    );
};
