export const article = {
    title: "Чи можливе навчання в задоволення?",
    text: [
        "Так, навчання МОЖЕ бути не лише ефективним, а й захопливим!",
        "Ми створили школу Indigo, щоб вивчення англійської мови стало простим і захопливим. Забудьте про нудні підручники — у нас маленькі групи, максимум практики та підтримка на кожному кроці.",
        "Indigo — це місце, де мову відчувають, а не просто вчать.",
        "Ми створюємо атмосферу, де діти з радістю відкривають нові знання. Наші інтерактивні методики, цікаві проекти та дружня підтримка допомагають кожній дитині розвивати свої здібності та впевненість у собі.",
        "Приєднуйтесь до нас і переконайтеся в цьому!",
    ],
};
