export const ctaDiscount = {
    title: "Шановні батьки!",
    text: "Отримайте фіксовану ціну на навчання а також бонуси і знижки при повній оплаті курсу або за другу дитину. \nЗапишіться на безкоштовний пробний урок вже сьогодні!",
};

export const ctaTrial = {
    title: "Спробуйте безкоштовний урок!",
    text: "Запишіться на безкоштовний пробний урок і переконайтеся, що навчання в Indigo — це цікаво, ефективно і весело! \nЗалиште свої контакти, і ми зв'яжемося з вами для узгодження зручного часу.",
};
export const ctaContact = {
    title: "Залишилися питання?",
    text: "Зв'яжіться з нами, і ми з радістю допоможемо вам обрати найкращий курс для вашої дитини. \nНаші консультанти нададуть всю необхідну інформацію та допоможуть з записом на навчання.",
};
